Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: User creates a private/public SSH keypair on their local computer
ru: Пользователь создает пару ключей SSH (закрытый и открытый) на локальном компьютере.

source: User inputs the public key into the SSH field of their hosting provider while setting up the host
ru: Пользователь копирует открытый ключ в поле SSH хостинг-провайдера при настройке хоста

source: User should write a routine for comparing OTU contents and merging group data.
ru: Пользователь должен написать процедуру для сравнения содержимого OTU и объединения данных общих групп.

source: User time is the time it took the code to run, and System time is the time which the kernel was using system resources.
ru: Пользовательское (user) время - это время, необходимое для исполнения кода программы, а системное (system) время - это время, в течение которого ядро использовало системные ресурсы для обеспечения сервиса браузеру.

source: Using VSCode with your remote machine
ru: Использование VSCode через удаленное соединение

source: Using the less command is simply for those moments when those tools are not available to you.
ru: Использование команды less удобно, если редактор недоступен или медленнее, чем нужно, грузится.

source: Using this new knowledge, let’s try to match the following line of text.
ru: Используя эти новые знания, попробуем сопоставить следующую строку текста.

source: Using this utility, we can query my site.
ru: Используя эту утилиту, можно запросить знакомый нам сайт.

source: VIRT - All virtual memory used for the process
ru: VIRT - Размер всей вирткальной памяти, занимаемой процессом

source: VIRT = RES + SWAP, so if a task’s VIRT is much higher than RES, this means that it is using SWAP, which means that the computer is running out of space for the process.
ru: VIRT = RES + SWAP, поэтому если VIRT намного больше, чем RES, это означает, что процесс активно использует SWAP, а это означает, что в оперативной памяти компьютера не хватает места для процесса.

source: Variable declarations
ru: Объявления переменных

source: Vasily Khristyuk
ru: Василий Христюк

source: Virtual Machines and SSH
ru: Виртуальные машины и SSH

source: Virtual Machines and SSH Protocol
ru: Виртуальные машины и протокол SSH

source: Visualization is partially presented in command set of Mothur.
ru: Визуализация частично представлена в наборе команд Mothur.

source: Wait Time = Real - User - System
ru: Время ожидания = Real - User - System

source: We all understand the basic concept of text matching, but sometimes don’t take a moment to think about what it really is.
ru: Все мы понимаем основную ижею сопоставления текстов друг с другом, но иногда не понятно, что это такое на самом деле.

source: We are integrating existing open-source technologies to support MiSeq SOP (standard operational procedure), which is to allow domain specialists, biologists, to process data independently.
ru: Осуществляется интеграция технологий с открытым исходным кодом для поддержки MiSeq SOP (стандартная операционная процедура), которая позволяет специалистам в предметной области, биологам, независимо обрабатывать данные.

source: We are matching “You” at the beginning of the line (^) and “is” at the end of the line ($).
ru: Мы хотим найти “You” вначале строки (^) и “is” в конце ($).

source: We are now matching just the email addresses again.
ru: Теперь снова сопоставляются только адреса электронной почты.

source: We are observing constant increasing of the data obtained from field investigations, each new data is compared with all the data obtained in the previous years.
ru: Мы наблюдаем постоянный рост объема данных, полученных в результате полевых исследований, каждая новая информация сравнивается со всеми данными, полученными в предыдущие годы.

source: We call this “broadband” and it is the reason we can talk on the phone, watch Netflix, and search the web all at the same time.
ru: Это называется «широкополосным доступом», и по этой причине можно одновременно разговаривать по телефону, смотреть Netflix и искать информацию в Интернете.

source: We can also change what fields are displayed by typing the letter f in interactive mode.
ru: Можно изменять, какие поля отображаются, введя букву f в интерактивном режиме.

source: We can also define an array of variables in bash and loop through them.
ru: Можем определить массив переменных в bash, и также перебрать их.

source: We can also do these commands interactively within the top program.
ru: Можно выполнять фильтрацию в интерактивном режиме программы top.

source: We can also filter the top program by process ID, or even user ID.
ru: Также можно фильтровать процессы по идентификатору процесса и по идентификатору пользователя.

source: We can also read user input from a script.
ru: Можно производить читение пользовательских данных в программе сценария.

source: We can also simulate this process in a terminal ourselves using the strace() command.
ru: Можно отследить этот процесс в терминале самостоятельно, используя strace() команду.

source: We can also test other conditions.
ru: Также можно вычислять другие условные выражения.

source: We can also type the following command to find the IP address for a given domain.
ru: Введем следующую команду, найдем IP-адрес домена.

source: We can also use the for loop syntax to loop through a bunch of files.
ru: Можно использовать цикл for для перебора множества файлов.

source: We can do this in one of two ways, which is a good introduction to the topic of “interactive” mode vs. “static” mode.
ru: Интервал настраивается двумя способами - «статическим» и «интерактивным».

source: We can do this on Mac/Linux using the OpenSSH tool.
ru: Это делается в ОС Mac и Linux с помощью пакета OpenSSH.

source: We can find the total user time (time it takes to run the actual code of a program) by adding us + ni.
ru: Можно вычислить общее время пользователя (время, необходимое для запуска непосредственно кода программы) - сумма us и ni.

source: We can now start the process again but this time, we will throw it in the background.
ru: Теперь можно снова запустить процесс, но на этот раз запустим его в фоновом режиме.

source: We can pip the stdout of one command to the stdin of grep.
ru: Результат (stdout), выдаваемый одной командой, можно передать на вход (stdin) grep.

source: We can run this file like so:
ru: Запуск программы осуществляется так:

source: We can send a process to the background in one of two ways:
ru: Можем перевести процесс в фоновый режим одним из двух способов:

source: We can send process signals using the kill command.
ru: Посылка сигналов процессам осуществляется командой kill.

source: We can start a process in the background by adding the & character at the end of the command.
ru: Процесс будет запущен в фоновом режиме если добавить & в конце команды.

source: We can use VSCode with files on our VPS with the help of the rmate command.
ru: Редактор VSCode может использоваться для редактирования файлов на VPS, это достигается при помощи команды rmate.

source: We can use these variables rather than the command line flags.
ru: Можно использовать переменные вместо задания флагов в командной строке.

source: We could also adjust this value by typing the letter d within the top program, and entering the number of seconds for the interval.
ru: Значение интервала настраивается нажатием клавиши d вводом длины интервала в секундах.

source: We could also define only the first 13 letters of the alphabet like so - [a-m].
ru: Аналогично можно задать только первые 13 букв алфавит: [a-m].

source: We could download this to our VPS using the following command.
ru: Загрузить ее это на наш VPS можно, используя следующую команду.

source: We could easily have written the same expression differently like so:
ru: Можно легко написать это выражение иначе:

source: We could have also run dig thediygolfer.com +short to get a similar output.
ru: Можно также запустить dig thediygolfer.com +short, при этом будет получен аналогичный результат.

source: We could probably find 40 different regular expressions that all match the line “regexp”.
ru: Целых 40 различных регулярных выражений, все соответствуют строке «regexp»!

source: We divide the sources of the uncertainties as external, e.g., a competitive environment and internal, which arise at industry itself.
ru: Мы разделяем источники неопределенностей на внешние, например, конкурентную среду, и внутренние, возникающие на самом предприятии.

source: We do not want to match this line at all.
ru: Эта строка вообще не должна быть сопоставлена.

source: We do not yet understand what the router does, but you now have the background information needed to understand my picture diagram.
ru: Пока нам не важно, что делает маршрутизатор, но теперь есть начальная информация, необходимая для понимания диаграммы.

source: We do this like so:
ru: Делается это так:

source: We have not discussed processes yet, but keep this in mind for later.
ru: Процессы пока не обсуждались, это на будущее.

source: We know that our internet service provider owns tons of wires and infrastructure that millions of people connect to, and each ISP connects to each other.
ru: Интернет-провайдеры владеют тоннами проводов и инфраструктурой, к которой подключаются миллионы людей, а также между провайдерами существуют соединения.

source: We need to add the new bin/ directory to our path.
ru: Тепер надо добавить новый каталог /bin к нашей PATH.

source: We need to construct data structures for efficient representation of multisets and their operations within construction of logical inferences.
ru: Также необходимо реализовать операции над мультимножествами в процессе построения логических выводов.

source: We obtained 11119 unique sequences, 1.3% of total number (a reasonable amount), thus, the initial data were reduced to its 25% number of readings.
ru: Мы получили 11119 уникальных последовательностей, 1.3% от общего количества (разумное количество), таким образом, к данному моменту произведено сокращение объема обрабатываемой информаци до 25% от исходного.

source: We propose to construct a PaaS and DaaS cloud consisting of independent network connected SaaS-services adopted for MiSeq standard operational procedure (MiSeq SOP) used in microbiome research of lake Baikal.
ru: Мы предлагаем построить облако PaaS и DaaS, состоящее из независимых сетевых SaaS-сервисов, адаптированных для стандартной операционной процедуры MiSeq (MiSeq SOP), используемой в исследовании микробиома озера Байкал.

source: We start by matching all characters with the . metacharacter starting at the beginning of each line (^).
ru: Начнем с сопоставления всех символов при помощи метасимвола ., соспоставление начинается с начала каждой строки (^).

source: We suggest rectify these approaches with synthesis (on the third level) of an optimal control supervisor automata preventing some events to happen, or as a result of computer simulation in discrete time with introduction various disturbances according to a predefined policy.
ru: Мы предлагаем обогатить эти подходы синтезом (на третьем уровне) оптимального супервизорного управления: (1) автомата, предотвращающего возникновения некоторых событий или (2) как результат имитационного моделирования в дискретном времени с моделирование возникновения событий в соответствии с предварительно определенной стратегией.

source: We use Model Driven Architecture (MDA) to generate modules for Rapidminer studio, a visual dataflow editor.
ru: Мы используем Model Driven Architecture (MDA) для создания модулей для Rapidminer studio, визуального редактора потока данных.

source: We want to find the number that Google Chrome is identified by (in my case it is job #1) and run the following command.
ru: Найдем номер, по которому идентифицируем Google Chrome (в данном случае - задание №1), выполним команду.

source: We will cover the following:
ru: Рассмотрим только следующее:

source: We will need the process ID to do this.
ru: Для этого нам понадобится идентификатор процесса.

source: We will start with a diagram to guide us through the process of searching for a website.
ru: Начнем с диаграммы, которая демонстрирует процесс поиска веб-сайта.

source: We will start with a simple find/replace operation with sed.
ru: Начнем с простой операции по поиску/замене при помощи sed.

source: We will start with the dig utility which helps us query DNS records for either IP addresses (using a reverse lookup) or a domain name.
ru: Начнем с программы dig, которая помогает запрашивать записи DNS для IP-адресов (с использованием обратного поиска) или доменного имени.

source: Well, this is a bit of a trick question, because we now must reverse the flow of information and start at the first link in the chain–your computer.
ru: Это сложный вопрос, так как теперь рассмотрим поток информации, начиная с первого звена в цепи - компьютера.

source: What I just explained is called “literal text matching” and can be done using any text searching utility.
ru: То, что мы только что рассмотрели, называется «буквальным сопоставлением текста» и может быть выполнено с помощью любой утилиты поиска текста.

source: What are these wires we speak of?
ru: О каком оборудовании мы говорим?

source: What is a Process?
ru: Что такое процесс?

source: What is a process?
ru: Что такое процесс?

source: What is the ^ at the beginning?
ru: Что обозначает символ ^, находящийся в начале выражения?

source: What we care more about is how to manage processes.
ru: Важнее уметь правлять процессами.

source: What your Internet Service Provider (ISP) is
ru: Что такое Интернет-провайдер (ISP)

source: When I registered it, the domain was placed in the .com top-level-domain database hosted by Verisign.
ru: При регистрауии домена, он был помещен в базу данных домена верхнего уровня .com, размещенную в Verisign.

source: When a bunch of alternative admissible futures were synthesized, the choice of the better one is carried on with assessing criteria, e.g., minimizing additional resource consumption.
ru: В случае, когда синтезированы несколько альтернативных приемлемых вариантов будущего, можно производить выбор лучшего на основе сравнения критериев оценки сценариев, например, минимизируюя дополнительные затраты ресурсов.

source: When executed, this command will find and print out the three date lines.
ru: При выполнении эта команда найдет и распечатает требуемые три строки с датой ответа.

source: When first starting the top program, you will see the above output in the header.
ru: При первом запуске программы top, экран заполнится информацией, как на рисунке.

source: When in the field manager, use you up and down arrow keys to highlight a specific field.
ru: Здесь можно просматривать информацию, пролистывая список вверх и вниз стрелками, так можно найти нужное поле.

source: When it reaches your home, it is converted to digital signals by your modem and is sent to the router.
ru: Придостижении дома, он преобразуется в цифровые сигналы модемом и отправляется на маршрутизатор.

source: When push comes to shove, you generally do not need to be proficient in sed nor awk.
ru: На самом деле для более сложных задач нет необходимости в е изучении sed и awk.

source: When reading through a file, a regular expression will go line by line (each line indicated by the \n character).
ru: При чтении файла регулярное выражение будет обрабатывать строки одну за другой (каждая строка обозначена символом \n).

source: When starting out with the bash shell, there are a few essential concepts beyond the basic commands that one must be aware of.
ru: Перед тем, как начать изучать командную болочку bash, есть несколько важных концепций, помимо основных команд, необходимых к изучению.

source: When the command asks you for a password, just press enter twice without entering anything because we do not need to password protect the key since we are using our personal computer.
ru: Когда команда ssh-keygen запросит пароль, просто дважды нажмите ввод ничего не вводя, потому что нам не нужно защищать ключ паролем, поскольку мы используем этот ключ для идентификации локального компьютера.

source: When used in a regex, the . matches all characters except the newline character (remember, regular expressions use that to determine where the end of a line is?).
ru: При использовании в шаблонах . не соответсвует только символам "перевод строки" и "возврат каретки", обозначающие конец строки.

source: When user tries to connect to the host via SSH, the SSH tool will validate the private/public keypair stored on the local computer in the ~/.ssh directory with the public key stored on the VPS.
ru: Подключение пользователя осуществляется через SSH, SSH проверит открытый и закрытый пару ключей, хранящиеся на локальном компьютере в каталоге ~/.ssh с открытым ключом, хранящимся на VPS.

source: When using character classes, there are a few “gotchas” that we need to cover.
ru: При использовании классов символов, есть несколько проблем, на которые надо обратить внимание.

source: When we run traceroute, we get the following output.
ru: При запуске traceroute, получаем следующий результат.

source: When you create a keypair, there will be a .pub version always.
ru: Каждый раз, как содается пара ключей, один их них, .pub, всегда присутствует.

source: When you first create a VPS in Digital Ocean (also called a “Droplet”), it will ask you whether you want to connect to the machine using a password or SSH key.
ru: Когда создается VPS в Digital Ocean, также называемый «капля», программное обеспечение хостинга спрашивает пользователя, хочет ли он подключиться к машине с помощью пароля или ключа SSH.

source: When you run a process in your bash shell, while that process is running, you will not have access to the terminal.
ru: После запуска процесса в оболочке bash и пока процесс исполняется, доступа к терминалу не будет.

source: When you run this command, you will see all of the system calls that were made when you ran the ls command.
ru: Эта команда позволяет увидеть все системные вызовы, которые были выполнены при запуске ls.

source: When you type this, you will see a bunch of different field options.
ru: Как только нажмета на эту букву, будет показана куча различных вариантов отображения данных.

source: When you write a regex, it will be tested against every line of the file.
ru: Созданные регулярные выражения проверяются на каждой строке файла.

source: When your computer starts up, the kernel will call a process called “init”, which on a UNIX-based operating system is usually the script called init located at /sbin/init.
ru: Когда компьютер запускается, ядро запускает процесс под названием "init", который в UNIX-системах обычно называется также init, расположенный в /sbin/init.

source: While designing our cloud storage we use the JHipster Domain Language [24] and its tools to create database structures, metadata converters, formal representations of the ontologies of the stored data.
ru: При проектировании облачного хранилища используется JHipster Domain Language [24] и его инструменты для создания структур баз данных, преобразования метаданных, формальных представлений онтологий для хранимых данных.

source: While grep searches for text in a file or a specified output, find searches explicitly for files in the filesystem.
ru: Напомним, что grep ищет текст в файле или в текте-результате предыдущей команды, find ищет именно файлы в файловой системе.

source: While your computer is on and running, the kernel is constantly working.
ru: После загрузки компьютера ядро операционной системы функционирует постоянно.

source: Why don’t they prevent you from working in the terminal?
ru: Почему они не мешают работать в терминале?

source: Why is this useful?
ru: Почему он полезен?

source: Why would I use sed over awk or vice-versa?
ru: Когда надо использовать sed, а когда awk?

source: With a shell variable, other scripts will not have access to it.
ru: С переменной оболочки все не так: другие сценарии не будут иметь к ней доступа.

source: With that in mind, the algorithm proceeds by ranking sequences in order of their abundance.
ru: С учетом этого алгоритм основывается на ранжировании последовательностей по их количеству.

source: With the invention of computers, integrated circuits and communications, information and network communication technology are closely combined with industrial process.
ru: С изобретением компьютеров, интегральных схем и сетей связи, информационные и коммуникационные технологии тесно связаны с производственными процессами.

source: With these concepts, you should be able to accomplish 95% of your tasks.
ru: Используя эти концепциии можно выполнить 95% задач.

source: With these priorities we will speed up the time of execution.
ru: С использованием этих приоритетаов, можно ускорить время имитационного моделирования.

source: With these quantifiers, we can complete our expression.
ru: При помощи кванторов, завершим формирование нашего выражения.

source: With this background knowledge, we can now look at some bash commands to help us diagnose network issues.
ru: Обладая этими базовыми знаниями, теперь можно взглянуть на некоторые команды bash, которые помогут нам диагностировать сетевые проблемы.

source: With this example path, when you try to run a script in the terminal such as cat, bash will first look in the /usr/local/bin for this command.
ru: В этом примере, если пользователь хочет запустить программу cat, bash сначала будет искать ее в директории /usr/local/bin.

source: With this new knowledge, we can create our own scripts and add those scripts to our path so we can run them automatically.
ru: Теперь можно создавать специальные библиотеки сценариев и запускать их автоматически из директориев, указанных в PATH.

source: Within the R&D, we obtained a set of transformation scenarios expressed as object knowledge sets represented in the Logtalk [25] programming language, which can be used to generate PSM and the source codes for representation of Mothur command for new computation and visualization environments.
ru: В рамках разработоки получен набор сценариев преобразования, выраженных в виде наборов знаний об объектах, представленных на языке программирования Logtalk [25]. Эти знания можно использовать для генерации PSM и исходных кодов для представления команды Mothur для новых сред вычислений и визуализации.

source: Within the local network, each device has a “subnet mask” which will create a unique IP address for each device within the bounds of the local area network address space.
ru: Внутри локальной сети каждое устройство имеет уникальный IP-адрес в пределах адресного пространства локальной сети, заданного соответствующей маской.

source: Without getting super technical, a process is anything on your computer that is owned by a single user and that consumes one of three system resources.
ru: Если не вдаваться в технические подробности, процесс - это что-нибудь на исполняющееся на компьютере, который принадлежит пользователю и потребляет три вида ресурсов системы.

source: You can also change the field which top sorts by highlighting the field and typing the letter s.
ru: Можно менять режим сортировки (поле по которому осуществляется сортировка) в главном экране, выделив поле и нажав клавишу s.

source: You can begin to see how powerful this new command is!
ru: Теперь вы видете, как крута эта команда!

source: You can do this through bash scripting, and in this brief introduction, I will teach you how to do just that.
ru: Такие задачи решаются при помощи сценариев bash, и здесь мы рассмотрим, как это делается.

source: You can now edit any file using VSCode by running the following command from your VPS!
ru: Редактировать файлы на VPS с помощью VSCode можно, если выполнить команду в командной тсроке VPS!
